Revit 2027 API
RebarBendingDetail.IsSchematicBendingDetail Method
 Validate that the element is a schematic bending detail.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSchematicBendingDetail(
	Element bendingDetail
)
Public Shared Function IsSchematicBendingDetail (
	bendingDetail As Element
) As Boolean
public:
static bool IsSchematicBendingDetail(
	Element^ bendingDetail
)
static member IsSchematicBendingDetail :
        bendingDetail : Element -> bool
Parameters
bendingDetail Element
 The element that will be checked.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace